print(1 + 1)  # 加法运算
print(1 - 1)  # 减法运算
print(2 * 4)  # 乘法运算
print(1 / 2)  # 除法运算
print(11 / 2)  # 除法运算
print(11 // 2)  # 5 整除运算
print(11 % 2)  # 取余运算
print(2 ** 3)  # 表示的是2的3次方   结果为# 8

print(9 // 4)  # 2
print(-9 // -4)  # 2

print('-------------以下重点-------------')
print(9 // -4)  # 一3
print(-9 // 4)  # -3   一正一负的整数公式，向下取整
print(9 % -4)  # -3   公式  余数=被除数-除数*商 9-(-4)*(-3)9-12-->   -3
print(-9 % 4)  # 3                         -9-4*(-3)-9+12-->    3

print('----------解包赋值-------')
a, b, c = 20, 30, 40
print(a, b, c)

# a, b=20，,30,40报错，因为左右变量的个数和值的个数不对应
print('-----------交换两个变量的值-------------')
a, b = 10, 20
print('交换之前:', a, b)  # 交换
a, b = b, a
print('交换之后:', a, b)

print('---------运算符优先级: 先乘除后加减 有幂先算幂 -----------')